In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'subha'],
    "mark":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'barelly','balasore']
}

## Convert the given dictionary in to dataframe

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## Convert the dataframe into csv file or any type of file i.e. Excel file

In [5]:
df.to_csv('friend.csv')

In [6]:
df.to_csv('friend_indexFalse.csv', index=False)

In [7]:
df.head(2) # To show first two rows

    name  mark     city
0  harry    92   rampur
1  rohan    34  kolkata

In [8]:
df.tail(2) # To show last two rows

     name  mark      city
2  skillf    24   barelly
3   subha    17  balasore

In [9]:
df.describe() # To describe the numerical values of the data set

           mark
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## To change a content in the csv file

In [11]:
df['name'][0] = 'Bubu'

C:\Users\mebub_9a7jdi8\AppData\Local\Temp\ipykernel_13088\2341372380.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 'Bubu'

In [12]:
df

     name  mark      city
0    Bubu    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## To change the Index number

In [13]:
df.index = ['first', 'second', 'third', 'fourth']

In [14]:
df

          name  mark      city
first     Bubu    92    rampur
second   rohan    34   kolkata
third   skillf    24   barelly
fourth   subha    17  balasore

## How to print a series

In [15]:
ser = pd.Series(np.random.rand(34))

In [16]:
ser

0     0.674190
1     0.485599
2     0.450791
3     0.190809
4     0.830369
5     0.589445
6     0.286087
7     0.990652
8     0.185445
9     0.381976
10    0.867284
11    0.220248
12    0.918172
13    0.948836
14    0.146758
15    0.771094
16    0.430948
17    0.311011
18    0.192619
19    0.873042
20    0.854767
21    0.550153
22    0.804099
23    0.308777
24    0.335256
25    0.574441
26    0.809414
27    0.200034
28    0.974687
29    0.747886
30    0.498938
31    0.495085
32    0.871821
33    0.450236
dtype: float64

In [17]:
type (ser)

pandas.core.series.Series

## To make a new dataframe

In [18]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [19]:
newdf.head()

          0         1         2         3         4
0  0.702217  0.923708  0.259200  0.524982  0.496971
1  0.849028  0.769802  0.883670  0.323103  0.939383
2  0.950162  0.444841  0.076574  0.776139  0.074358
3  0.946049  0.314503  0.379802  0.442014  0.758148
4  0.620420  0.738981  0.494159  0.403256  0.241247

In [20]:
type(newdf)

pandas.core.frame.DataFrame

## To change the dara type

In [21]:
# newdf[0][0] = "bubu"

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.head()

          0         1         2         3         4
0  0.702217  0.923708  0.259200  0.524982  0.496971
1  0.849028  0.769802  0.883670  0.323103  0.939383
2  0.950162  0.444841  0.076574  0.776139  0.074358
3  0.946049  0.314503  0.379802  0.442014  0.758148
4  0.620420  0.738981  0.494159  0.403256  0.241247

In [24]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

## How to convert a dataframe into numpy arrays

In [25]:
newdf.to_numpy()

array([[0.70221669, 0.92370788, 0.25920028, 0.52498221, 0.49697141],
       [0.84902804, 0.76980172, 0.88366964, 0.32310294, 0.93938251],
       [0.95016225, 0.44484086, 0.07657441, 0.77613899, 0.07435816],
       ...,
       [0.85244576, 0.06588105, 0.6883256 , 0.73388682, 0.08505519],
       [0.51413733, 0.95208412, 0.58794432, 0.17065361, 0.37379724],
       [0.94922766, 0.9293486 , 0.60101759, 0.92758663, 0.9245314 ]])

## Transpose (convert rows into columns and vice versa)

In [26]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.702217,0.849028,0.950162,0.946049,0.620420,0.443452,0.447293,0.081530,0.333555,0.320481,...,0.603794,0.263741,0.394487,0.177145,0.658945,0.427329,0.555079,0.852446,0.514137,0.949228
1,0.923708,0.769802,0.444841,0.314503,0.738981,0.594387,0.466345,0.443566,0.549738,0.851800,...,0.815560,0.573994,0.898859,0.746975,0.131447,0.900832,0.223160,0.065881,0.952084,0.929349
2,0.259200,0.883670,0.076574,0.379802,0.494159,0.882427,0.258969,0.051070,0.763216,0.779365,...,0.931165,0.825866,0.148338,0.978576,0.807704,0.340793,0.824479,0.688326,0.587944,0.601018
3,0.524982,0.323103,0.776139,0.442014,0.403256,0.760302,0.750634,0.641224,0.905773,0.980225,...,0.978113,0.509636,0.810411,0.889212,0.618525,0.206068,0.551342,0.733887,0.170654,0.927587
4,0.496971,0.939383,0.074358,0.758148,0.241247,0.688128,0.258850,0.182581,0.458410,0.070386,...,0.611625,0.582812,0.652119,0.272643,0.470343,0.764197,0.129768,0.085055,0.373797,0.924531

Sort the dataframe upside down

In [27]:
newdf.sort_index(axis=0, ascending=False).head()  # axis=0 : Row, axis=1 : column

            0         1         2         3         4
333  0.949228  0.929349  0.601018  0.927587  0.924531
332  0.514137  0.952084  0.587944  0.170654  0.373797
331  0.852446  0.065881  0.688326  0.733887  0.085055
330  0.555079  0.223160  0.824479  0.551342  0.129768
329  0.427329  0.900832  0.340793  0.206068  0.764197

In [28]:
newdf[0]

0      0.702217
1      0.849028
2      0.950162
3      0.946049
4      0.620420
         ...
329    0.427329
330    0.555079
331    0.852446
332    0.514137
333    0.949228
Name: 0, Length: 334, dtype: float64

In [29]:
newdf2 = newdf.copy()

In [30]:
newdf2[0][0] = 97835

In [31]:
newdf.head()

          0         1         2         3         4
0  0.702217  0.923708  0.259200  0.524982  0.496971
1  0.849028  0.769802  0.883670  0.323103  0.939383
2  0.950162  0.444841  0.076574  0.776139  0.074358
3  0.946049  0.314503  0.379802  0.442014  0.758148
4  0.620420  0.738981  0.494159  0.403256  0.241247

In [32]:
newdf2.head()

              0         1         2         3         4
0  97835.000000  0.923708  0.259200  0.524982  0.496971
1      0.849028  0.769802  0.883670  0.323103  0.939383
2      0.950162  0.444841  0.076574  0.776139  0.074358
3      0.946049  0.314503  0.379802  0.442014  0.758148
4      0.620420  0.738981  0.494159  0.403256  0.241247

In [33]:
newdf.columns = list("ABCDE") # To change the naming of the columns

In [34]:
newdf.head(2)

          A         B        C         D         E
0  0.702217  0.923708  0.25920  0.524982  0.496971
1  0.849028  0.769802  0.88367  0.323103  0.939383

In [35]:
newdf.loc[0, 'A'] = 65445

In [36]:
newdf.loc[0, 0] = 65445

In [37]:
newdf.head()

              A         B         C         D         E        0
0  65445.000000  0.923708  0.259200  0.524982  0.496971  65445.0
1      0.849028  0.769802  0.883670  0.323103  0.939383      NaN
2      0.950162  0.444841  0.076574  0.776139  0.074358      NaN
3      0.946049  0.314503  0.379802  0.442014  0.758148      NaN
4      0.620420  0.738981  0.494159  0.403256  0.241247      NaN

In [38]:
newdf = newdf.drop(0, axis=1) # To drop a column (axis=1) , to drop a row (axis=0)

In [39]:
newdf.head()

              A         B         C         D         E
0  65445.000000  0.923708  0.259200  0.524982  0.496971
1      0.849028  0.769802  0.883670  0.323103  0.939383
2      0.950162  0.444841  0.076574  0.776139  0.074358
3      0.946049  0.314503  0.379802  0.442014  0.758148
4      0.620420  0.738981  0.494159  0.403256  0.241247

In [40]:
newdf.loc[[1,2], ['C', 'D']]

          C         D
1  0.883670  0.323103
2  0.076574  0.776139

In [41]:
newdf.head()

              A         B         C         D         E
0  65445.000000  0.923708  0.259200  0.524982  0.496971
1      0.849028  0.769802  0.883670  0.323103  0.939383
2      0.950162  0.444841  0.076574  0.776139  0.074358
3      0.946049  0.314503  0.379802  0.442014  0.758148
4      0.620420  0.738981  0.494159  0.403256  0.241247

In [42]:
newdf.loc[[1,2], :]

          A         B         C         D         E
1  0.849028  0.769802  0.883670  0.323103  0.939383
2  0.950162  0.444841  0.076574  0.776139  0.074358

In [43]:
newdf.loc[(newdf['A']<0.3)] # Applying a condition

            A         B         C         D         E
7    0.081530  0.443566  0.051070  0.641224  0.182581
10   0.069941  0.028621  0.153320  0.319281  0.478298
13   0.041209  0.229171  0.359312  0.361204  0.540582
14   0.280075  0.952507  0.977163  0.937404  0.103720
15   0.013815  0.531852  0.241433  0.303093  0.904927
..        ...       ...       ...       ...       ...
315  0.165512  0.333142  0.231138  0.613065  0.091939
322  0.214761  0.936437  0.950671  0.310580  0.712946
323  0.006906  0.203342  0.296265  0.369739  0.421447
325  0.263741  0.573994  0.825866  0.509636  0.582812
327  0.177145  0.746975  0.978576  0.889212  0.272643

[102 rows x 5 columns]

In [44]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
10   0.069941  0.028621  0.153320  0.319281  0.478298
13   0.041209  0.229171  0.359312  0.361204  0.540582
14   0.280075  0.952507  0.977163  0.937404  0.103720
15   0.013815  0.531852  0.241433  0.303093  0.904927
17   0.245447  0.322934  0.502634  0.968776  0.896276
..        ...       ...       ...       ...       ...
315  0.165512  0.333142  0.231138  0.613065  0.091939
322  0.214761  0.936437  0.950671  0.310580  0.712946
323  0.006906  0.203342  0.296265  0.369739  0.421447
325  0.263741  0.573994  0.825866  0.509636  0.582812
327  0.177145  0.746975  0.978576  0.889212  0.272643

[93 rows x 5 columns]

In [45]:
newdf.iloc[0,4] # iloc is used to show to conyent of the specific cell (if you don't want to use names)

0.4969714145543338

In [46]:
newdf.iloc[[0,5], [1,2]]

          B         C
0  0.923708  0.259200
5  0.594387  0.882427

In [47]:
newdf.head()

              A         B         C         D         E
0  65445.000000  0.923708  0.259200  0.524982  0.496971
1      0.849028  0.769802  0.883670  0.323103  0.939383
2      0.950162  0.444841  0.076574  0.776139  0.074358
3      0.946049  0.314503  0.379802  0.442014  0.758148
4      0.620420  0.738981  0.494159  0.403256  0.241247

In [48]:
# newdf.drop(['A', 'D'], axis=1, inplace=True) # inplace is used to update the data base with current chages

In [49]:
newdf

                A         B         C         D         E
0    65445.000000  0.923708  0.259200  0.524982  0.496971
1        0.849028  0.769802  0.883670  0.323103  0.939383
2        0.950162  0.444841  0.076574  0.776139  0.074358
3        0.946049  0.314503  0.379802  0.442014  0.758148
4        0.620420  0.738981  0.494159  0.403256  0.241247
..            ...       ...       ...       ...       ...
329      0.427329  0.900832  0.340793  0.206068  0.764197
330      0.555079  0.223160  0.824479  0.551342  0.129768
331      0.852446  0.065881  0.688326  0.733887  0.085055
332      0.514137  0.952084  0.587944  0.170654  0.373797
333      0.949228  0.929349  0.601018  0.927587  0.924531

[334 rows x 5 columns]

In [50]:
newdf.reset_index(drop=True,inplace= True)

In [51]:
newdf.head()

              A         B         C         D         E
0  65445.000000  0.923708  0.259200  0.524982  0.496971
1      0.849028  0.769802  0.883670  0.323103  0.939383
2      0.950162  0.444841  0.076574  0.776139  0.074358
3      0.946049  0.314503  0.379802  0.442014  0.758148
4      0.620420  0.738981  0.494159  0.403256  0.241247

In [52]:
newdf.loc[:, ['B']] = 56

In [53]:
newdf

                A     B         C         D         E
0    65445.000000  56.0  0.259200  0.524982  0.496971
1        0.849028  56.0  0.883670  0.323103  0.939383
2        0.950162  56.0  0.076574  0.776139  0.074358
3        0.946049  56.0  0.379802  0.442014  0.758148
4        0.620420  56.0  0.494159  0.403256  0.241247
..            ...   ...       ...       ...       ...
329      0.427329  56.0  0.340793  0.206068  0.764197
330      0.555079  56.0  0.824479  0.551342  0.129768
331      0.852446  56.0  0.688326  0.733887  0.085055
332      0.514137  56.0  0.587944  0.170654  0.373797
333      0.949228  56.0  0.601018  0.927587  0.924531

[334 rows x 5 columns]

In [54]:
newdf.head()

              A     B         C         D         E
0  65445.000000  56.0  0.259200  0.524982  0.496971
1      0.849028  56.0  0.883670  0.323103  0.939383
2      0.950162  56.0  0.076574  0.776139  0.074358
3      0.946049  56.0  0.379802  0.442014  0.758148
4      0.620420  56.0  0.494159  0.403256  0.241247

## Exercise:

In [58]:
df = pd.DataFrame({"A" : [1, 2, 3],
                   "B": [3,2, 1]})

In [59]:
df.head()

   A  B
0  1  3
1  2  2
2  3  1

In [60]:
df.describe()

         A    B
count  3.0  3.0
mean   2.0  2.0
std    1.0  1.0
min    1.0  1.0
25%    1.5  1.5
50%    2.0  2.0
75%    2.5  2.5
max    3.0  3.0

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [62]:
df.mean()

A    2.0
B    2.0
dtype: float64

In [64]:
df.corr()

     A    B
A  1.0 -1.0
B -1.0  1.0

In [65]:
df.count()

A    3
B    3
dtype: int64

In [66]:
df.max()

A    3
B    3
dtype: int64

In [68]:
df.min()

A    1
B    1
dtype: int64

In [69]:
df.median()

A    2.0
B    2.0
dtype: float64

In [70]:
df.std()

A    1.0
B    1.0
dtype: float64